[	
	{"title":"Bienvenue sur Ruby on Rails",
	 "content":"Learning to build a modern web application is daunting. Ruby on Rails makes it much easier and more fun. It includes everything you need to build fantastic applications, and you can learn it with the support of our large, friendly community.",
	 "slug":"bienvenue-sur-ruby-on-rails",
	 "users_id":3},
	 {"title":"Projet Ruby x ReactJS",
	  "content":"Une bibliothèque JavaScript pour créer des interfaces utilisateurs",
	  "slug":"projet-ruby-x-reactjs",
	  "users_id":3},
	  {"title":"React \u0026 Redux : Les concepts",
	  "content":"React est devenu une référence dans le monde des développeurs front-end. Il a même su s’imposer au sein des back-end grâce à NodeJS et aux systèmes d’isomorphisme. React se positionne principalement en concurrent direct d’Angular et de Vue bien que ce dernier soit arrivé plus tard et ce soit fortement inspiré de React. Angular se présente comme un véritable framework avec tous ses outils ainsi que d’une arborescence définie. Du côté de React, il est difficile d’en dire autant. Ce n’est pas un framework, il s’agit d’un outils et par conséquent il est beaucoup plus flexible. Il sera plus adapté pour implémenter des briques isolés de votre page. React est un formidable outils, d’autant plus qu’avec la surcouche JSX, il devient très agréable de développer avec. L’association avec Redux permet de décupler les possibilités. Petit tour d’horizon !",
	  "slug":"react-redux-concept",
	  "users_id":4},
	  {"title":"Créer un serveur de log avec Docker, Elastic Search, Kibana et Nginx : Architecture et mise en place",
	  "content":"Elastic search et Kibana sont des outils performants pour stocker et requêter les données en mode 'full text search'. Le moteur Lucêne offre de bonnes performances en lecture. Ce couple d’outils peut être une option intéressante à considérer pour la mise en place d’un serveur de log : Elastic Search expose des APIs pour envoyer des données de logs applicatifs et Kibana offre des outils (grilles et graphiques) de visualisation de données. De plus, certain logger comme Seri Log permettent d’envoyer les logs applicatifs directement vers une instance Elastic Search.Dans cet article, nous allons découvrir comment créer un serveur de log en utilisant Docker pour 'conteneriser' Elastic Search et Kibana. Dans un second temps nous verrons comment configurer Seri Log dans une application ASP net Core pour utiliser notre serveur de log. Dans un second article, nous verrons comment héberger ce serveur de log dans Azure. ","slug":"creer-un-serveur-de-log-avec-docker-elastic-search-kibana-and-nginx-architecture-et-mise-en-place",
	  "users_id":4},
	  {"title":"How to create an API with Django",
	  "content":"An API, or Application Programming Interface, is a broadly defined area of backend development. Essentially, the API we will examine today is a website without the frontend: instead of rendering HTML pages, this backend returns data in the JSON format for use in native or web applications. Just like when creating a website, the most important thing to consider when writing an API is how it will be used. Today, we will discover how to use Django to create an API for a basic ToDo application. Following this tutorial will require a few tools. I encourage you to follow along with this article by cloning the example project from this GitHub repository. You should have Python 3, Django 2.2, and djangorestframework 3.9 installed (from the repository, run pip install -r requirements.txt to install the libraries). For guidance on installing Django, please consult the official documentation. Also, you'll want to download the free version of Postman. Postman is an excellent tool for developing and testing APIs, and we will only scratch the surface of its features in this article. ",
	  "slug":"how-to-create-an-api-with-django",
	  "users_id":3},
	  {"title":"What is GraphQL?",
	  "content":"GraphQL is one of the biggest buzzwords in software tech today. But what is it actually? Is it a query language like SQL? An execution engine like the JVM? A specification like XML? If you answered all of the above, you are correct! GraphQL is a query language syntax, a programming language-agnostic execution engine, and a continuously evolving specification. Let's dive into how GraphQL can be all of these things and get a glimpse of why people are excited about it.",
	  "slug":"what-is-graphql",
	  "users_id":5},
	  { "title":"Build Your 1st Python Web App With Flask",
	    "content":"Python, the most favorite language amongst beginners, is known for its simplicity and its clean and concise way of implementing things. Despite the hype around machine learning, Python has done enough to conquer the web application domain as well.",
	    "slug":"build-your-1st-python-web-app-with-flask",
	    "users_id":4},
	    {"title":"Getting Started With JHipster",
	    "content":"If you like the Ruby on Rails or Grails approach to getting an application up-and-running in a hurry, then this may be the right fit for you. jHipster aims to make setting-up an app fairly painless. In this JHipster series we are going to take you through, first, creating a monolithic application. Secondly, we will make an app in the microservices style. Last, we’ll give you some tips and tricks.",
	     "slug":"getting-started-with-jhipster",
         "users_id":3}
]